function [CCT,Duv] = xyz2CCT_MacAdam(xyz)
    xyY=[xyz(:,1)./sum(xyz,2),xyz(:,2)./sum(xyz,2),xyz(:,2)];
    n=(xyY(:,1)-0.3320)./(xyY(:,2)-0.1858);
    CCT = 437 * n.^3 + 3601 * n.^2 + 6861 * n + 5517;
    %计算Duv
    u = (4 * xyY(:,1)) ./ (-2 * xyY(:,1) + 12 * xyY(:,2) + 3);
    v = (6 * xyY(:,2)) ./ (-2 * xyY(:,1) + 12 * xyY(:,2) + 3);
    
    k6 = -0.00616793;
    k5 = 0.0893944;
    k4 = -0.5179722;
    k3 = 1.5317403;
    k2 = -2.4243787;
    k1 = 1.925865;
    k0 = -0.471106;
    
    Lfp = sqrt((u - 0.292).^2 + (v - 0.24).^2);
    a = acos((u - 0.292) ./ Lfp);  % 注意：当Lfp为0时需特殊处理，这里假设Lfp不会为0
    
    Lbb = k6 * a.^6 + k5 * a.^5 + k4 * a.^4 + k3 * a.^3 +...
          k2 * a.^2 + k1 * a + k0;
    Duv = Lfp - Lbb;
end

