function [x,y,z]=rgb2xyz(r,g,b,w)
%% camera model
% V = Signal2V2([r,g,b]');
% XYZ = w*V;
% XYZ(XYZ<0)=0;
% 
% x=XYZ(1)/3.8946;
% y=XYZ(2)/3.8946;
% z=XYZ(3)/3.8946;
 %考虑相机修正，精确地raw rgb到xyz变换
 
 %% test LLsc database rgb2xyz model
 
 M = [   -0.0036    0.0308    0.1133
     0.0200   -0.0457    0.0786
     0.0571    0.0737   -0.0181
     0.0007    0.0002   -0.0004
     -0.0012   -0.0012   -0.0010
     -0.0013   -0.0012   -0.0015
     0.0006    0.0003   -0.0004
     -0.0001    0.0011   -0.0001
     0.0006    0.0003    0.0018
     0.0000    0.0000    0.0000
     1.4202    2.0725   -0.7453];
 r=255*r;
 g=255*g;
 b=255*b;
 V=[r,g,b,r*g,r*b,g*b,r^2,g^2,b^2,r*g*b,1]';
 V = double(V);
 xyz = M'*V;
 x=xyz(1);
 y=xyz(2);
 z=xyz(3);
 